OpenFOAM-v1812/tutorials/multiphase/interFoam/laminar/oscillatingBox/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

#------------------------------------------------------------------------------
